<?php 

  /*

   PHP 验证码制作(中文)

  */

   session_start();
  $res=imagecreatetruecolor(200,60);

//在画布上画各种图形


//为资源分配颜色（imagecolorallocate）
$white=imagecolorallocate($res,139,176,205);
//为资源填充颜色（imagefill）
imagefill($res,0,0,$white);
/*

背景数字算法

*/

/*for($i=0;$i<4;$i++){
	$fontsize=6;
	$fontcolor=imagecolorallocate($res,rand(0,120),rand(0,120),rand(0,120));
	$fontcontent=rand(0,9);
    $x=($i*100/4)+rand(5,10);
    $y=rand(5,10);
    imagestring($res,$fontsize,$x,$y,$fontcontent,$fontcolor);

}*/

$fontface="wenzi2.ttf";
$str="环境和霍建华高交会馆刚好根据计划刚果环境和霍建华高交会馆刚好根据计划刚果环境和霍建华高交会馆刚好根据计划刚果环境和霍建华高交会馆刚好根据计划刚果环境和霍建华高交会馆刚好根据计划刚果环境和霍建华高交会馆刚好根据计划刚果环境和霍建华高交会馆刚好根据计划刚果环境和霍建华高交会馆刚好根据计划刚果环境和霍建华高交会馆刚好根据计划刚果环境和霍建华高交会馆刚好根据计划刚果环境和霍建华高交会馆刚好根据计划刚果环境和霍建华高交会馆刚好根据计划刚果环境和霍建华高交会馆刚好根据计划刚果环境和霍建华高交会馆刚好根据计划刚果环境和霍建华高交会馆刚好根据计划刚果环境和霍建华高交会馆刚好根据计划刚果环境和霍建华高交会馆刚好根据计划刚果环境和霍建华高交会馆刚好根据计划刚果环境和霍建华高交会馆刚好根据计划刚果环境和霍建华高交会馆刚好根据计划刚果环境和霍建华高交会馆刚好根据计划刚果环境和霍建华高交会馆刚好根据计划刚果环境和霍建华高交会馆刚好根据计划刚果环境和霍建华高交会馆刚好根据计划刚果环境和霍建华高交会馆刚好根据计划刚果环境和霍建华高交会馆刚好根据计划刚果环境和霍建华高交会馆刚好根据计划刚果环境和霍建华高交会馆刚好根据计划刚果环境和霍建华高交会馆刚好根据计划刚果环境和霍建华高交会馆刚好根据计划刚果环境和霍建华高交会馆刚好根据计划刚果环境和霍建华高交会馆刚好根据计划刚果环境和霍建华高交会馆刚好根据计划刚果环境和霍建华高交会馆刚好根据计划刚果环境和霍建华高交会馆刚好根据计划刚果环境和霍建华高交会馆刚好根据计划刚果环境和霍建华高交会馆刚好根据计划刚果环境和霍建华高交会馆刚好根据计划刚果环境和霍建华高交会馆刚好根据计划刚果环境和霍建华高交会馆刚好根据计划刚果环境和霍建华高交会馆刚好根据计划刚果环境和霍建华高交会馆刚好根据计划刚果环境和霍建华高交会馆刚好根据计划刚果环境和霍建华高交会馆刚好根据计划刚果环境和霍建华高交会馆刚好根据计划刚果环境和霍建华高交会馆刚好根据计划刚果环境和霍建华高交会馆刚好根据计划刚果环境和霍建华高交会馆刚好根据计划刚果环境和霍建华高交会馆刚好根据计划刚果环境和霍建华高交会馆刚好根据计划刚果环境和霍建华高交会馆刚好根据计划刚果环境和霍建华高交会馆刚好根据计划刚果环境和霍建华高交会馆刚好根据计划刚果环境和霍建华高交会馆刚好根据计划刚果环境和霍建华高交会馆刚好根据计划刚果环境和霍建华高交会馆刚好根据计划刚果环境和霍建华高交会馆刚好根据计划刚果环境和霍建华高交会馆刚好根据计划刚果环境和霍建华高交会馆刚好根据计划刚果环境和霍建华高交会馆刚好根据计划刚果环境和霍建华高交会馆刚好根据计划刚果环境和霍建华高交会馆刚好根据计划刚果环境和霍建华高交会馆刚好根据计划刚果环境和霍建华高交会馆刚好根据计划刚果环境和霍建华高交会馆刚好根据计划刚果环境和霍建华高交会馆刚好根据计划刚果环境和霍建华高交会馆刚好根据计划刚果环境和霍建华高交会馆刚好根据计划刚果环境和霍建华高交会馆刚好根据计划刚果环境和霍建华高交会馆刚好根据计划刚果环境和霍建华高交会馆刚好根据计划刚果环境和霍建华高交会馆刚好根据计划刚果环境和霍建华高交会馆刚好根据计划刚果环境和霍建华高交会馆刚好根据计划刚果环境和霍建华高交会馆刚好根据计划刚果环境和霍建华高交会馆刚好根据计划刚果环境和霍建华高交会馆刚好根据计划刚果环境和霍建华高交会馆刚好根据计划刚果环境和霍建华高交会馆刚好根据计划刚果环境和霍建华高交会馆刚好根据计划刚果环境和霍建华高交会馆刚好根据计划刚果环境和霍建华高交会馆刚好根据计划刚果环境和霍建华高交会馆刚好根据计划刚果环境和霍建华高交会馆刚好根据计划刚果环境和霍建华高交会馆刚好根据计划刚果环境和霍建华高交会馆刚好根据计划刚果环境和霍建华高交会馆刚好根据计划刚果环境和霍建华高交会馆刚好根据计划刚果环境和霍建华高交会馆刚好根据计划刚果环境和霍建华高交会馆刚好根据计划刚果环境和霍建华高交会馆刚好根据计划刚果环境和霍建华高交会馆刚好根据计划刚果环境和霍建华高交会馆刚好根据计划刚果环境和霍建华高交会馆刚好根据计划刚果环境和霍建华高交会馆刚好根据计划刚果环境和霍建华高交会馆刚好根据计划刚果环境和霍建华高交会馆刚好根据计划刚果环境和霍建华高交会馆刚好根据计划刚果环境和霍建华高交会馆刚好根据计划刚果环境和霍建华高交会馆刚好根据计划刚果环境和霍建华高交会馆刚好根据计划刚果环境和霍建华高交会馆刚好根据计划刚果环境和霍建华高交会馆刚好根据计划刚果环境和霍建华高交会馆刚好根据计划刚果环境和霍建华高交会馆刚好根据计划刚果环境和霍建华高交会馆刚好根据计划刚果环境和霍建华高交会馆刚好根据计划刚果环境和霍建华高交会馆刚好根据计划刚果环境和霍建华高交会馆刚好根据计划刚果环境和霍建华高交会馆刚好根据计划刚果环境和霍建华高交会馆刚好根据计划刚果环境和霍建华高交会馆刚好根据计划刚果环境和霍建华高交会馆刚好根据计划刚果环境和霍建华高交会馆刚好根据计划刚果环境和霍建华高交会馆刚好根据计划刚果环境和霍建华高交会馆刚好根据计划刚果环境和霍建华高交会馆刚好根据计划刚果环境和霍建华高交会馆刚好根据计划刚果环境和霍建华高交会馆刚好根据计划刚果环境和霍建华高交会馆刚好根据计划刚果环境和霍建华高交会馆刚好根据计划刚果环境和霍建华高交会馆刚好根据计划刚果环境和霍建华高交会馆刚好根据计划刚果环境和霍建华高交会馆刚好根据计划刚果环境和霍建华高交会馆刚好根据计划刚果环境和霍建华高交会馆刚好根据计划刚果环境和霍建华高交会馆刚好根据计划刚果环境和霍建华高交会馆刚好根据计划刚果环境和霍建华高交会馆刚好根据计划刚果环境和霍建华高交会馆刚好根据计划刚果环境和霍建华高交会馆刚好根据计划刚果环境和霍建华高交会馆刚好根据计划刚果环境和霍建华高交会馆刚好根据计划刚果";
$str2=str_split($str,3);
$code='';
for($i=0;$i<4;$i++){
	$fontcolor=imagecolorallocate($res,rand(0,120),rand(0,120),rand(0,120));

	$index=rand(0,count($str2));
	$cn=$str2[$index];

    $code.=$cn;
 imagettftext($res,mt_rand(20,24),mt_rand(-60,60),(40*$i+20),mt_rand(30,35),$fontcolor,$fontface,$cn);
}
$_SESSION['authcode']=$code;



/*

背景小乱点算法

*/

for($i=0;$i<200;$i++){
	$pointcolor=imagecolorallocate($res,rand(50,200),rand(50,200),rand(50,200));
	imagesetpixel($res,rand(1,199),rand(1,59),$pointcolor);

}

/*

线算法

*/
for($i=0;$i<3;$i++){
	$linecolor=imagecolorallocate($res,rand(80,220),rand(80,220),rand(80,220));
	imageline($res,rand(1,199),rand(1,59),rand(1,199),rand(1,59),$linecolor);

}


//输出图像

header('Content-type:image/gif;charset=UTF8');
imagegif($res);

//销毁资源
imagedestroy($res);





?>